import rule1 from "../assets/rule1.jpg";
import rule2 from "../assets/rule2.jpg";
import rule3 from "../assets/rule3.jpg";
import rule4 from "../assets/rule4.jpg";
import rule5 from "../assets/rule5.jpg";
import rule6 from "../assets/rule6.jpg";
import rule7 from "../assets/rule7.jpg";
import rule8 from "../assets/rule8.jpg";

export const rules = [
    { pic: `${rule1}`, name: "Пешеходный переход", desc: "Переходить улицу нужно по пешеходному переходу, если нет светофора. Разговор по мобильному телефону, использование плеера, глухой капюшон создают реальную угрозу жизни, так как можно не услышать/увидеть, приближающееся транспортное средство или сигнал водителя, и подвергает себя опасности." },
    { pic: `${rule2}`, name: "Велосипеды и самокаты", desc: "При пересечении дороги по пешеходному переходу велосипедист должен слезть с велосипеда и пересечь его пешком - только в этом случае автомобилисты обязаны уступить ему дорогу." },
    { pic: `${rule3}`, name: "Переходим дорогу", desc: "Прежде чем переходить любую дорогу, остановись на краю тротуара. При переходе  обязательно надо посмотреть сначала налево, а дойдя до середины — направо. Начинать движение нужно тогда, когда ты убедился, что водитель увидел тебя и пропускает. Переходи дорогу под прямым углом к тротуару, а не наискосок." },
    { pic: `${rule4}`, name: "Светофор", desc: "Если на дороге установлен светофор, то пересекать её можно лишь при зеленом сигнале, убедившись, что все транспортные средства остановились." },
    { pic: `${rule5}`, name: "Общественный транспорт", desc: "Обходить стоящий автобус, троллейбус нужно сзади, а трамваи спереди, но лучше дождаться, когда он отъедет от остановки и освободит вам и водителям обзор и только после этого переходить дорогу. Выходить из общественного транспорта нужно только после полной остановки, при поездке нужно крепко держаться за поручни." },
    { pic: `${rule6}`, name: "Игры и дорога", desc: "Нельзя играть в снежки, футбол и другие игры на тротуарах и проезжей части улицы – это мешает пешеходам и движению транспорта, это опасно, так как можно неожиданно попасть на дорогу." },
    { pic: `${rule7}`, name: "Подземный переход", desc: "При наличии подземного перехода дорогу переходить только по переходу." },
    { pic: `${rule8}`, name: "Перебегать нельзя!", desc: "Перебегать дорогу нельзя ни в коем случае, тем более если зона видимости плохая, нужно встать, осмотреться, убедиться в отсутствии движущегося транспорта, и только затем начинать двигаться под прямым углом к краю проезжей части. " },
]