

const Info = () => {
    return (
        <section className="info">
            <h1 className="info__heading">
                «Безопасная дорога — детям»
            </h1>
            <p className="info__info">
                Машины, дороги с активным движением окружают нас с самого детства, каждый должен знать насколько они опасны. Знание правил поведения — залог безопасности.
                Причем важны они не только для водителей, но и для остальных участников дорожного движения.
            </p>
            <div className="info__pic"></div>
        </section>
    )
}

export default Info;